app/controllers/products_controller.rb

INSERT INTO "products" ("product_name", "product_dasherize_vanity_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_name", "vinay shankar"], ["product_dasherize_vanity_url", "vinay-shankar"], ["created_at", "2015-06-27 13:22:31.829535"], ["updated_at", "2015-06-27 13:22:31.829535"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "product_name" = ?, "product_dasherize_vanity_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_name", "vinay shankar sharma"], ["product_dasherize_vanity_url", "vinay-shankar-sharma"], ["updated_at", "2015-06-27 13:38:02.714618"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT  "products".* FROM "products" WHERE (id = 'vinay-shankar-sharma' or product_dasherize_vanity_url = 'vinay-shankar-sharma')  ORDER BY "products"."id" ASC LIMIT 1
---
    def set_product
      if params[:id].is_number?
        @product = Product.where("id = ?",params[:id]).first