app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "dasherize_vanity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "first user"], ["dasherize_vanity", "first-user"], ["created_at", "2015-06-27 13:56:17.941400"], ["updated_at", "2015-06-27 13:56:17.941400"]]

    def set_user
      @user = User.where("id = ? or dasherize_vanity= ?",params[:id],params[:id]).first
---
SELECT  "users".* FROM "users" WHERE (id = '1' or dasherize_vanity= '1')  ORDER BY "users"."id" ASC LIMIT 1